grblHAL/STM32F4xx/Src/driver.c
#if SPINDLE_SYNC_ENABLE

#include "grbl/spindle_sync.h"

static spindle_data_t spindle_data;
static spindle_encoder_t spindle_encoder = {
    .tics_per_irq = 4
};
static spindle_sync_t spindle_tracker;
static volatile bool spindleLock = false;

static void stepperPulseStartSynchronized (stepper_t *stepper);
static void spindleDataReset (void);
static spindle_data_t *spindleGetData (spindle_data_request_t request);

#endif

static void driver_delay (uint32_t ms, delay_callback_ptr callback)
{
    if((delay.ms = ms) > 0) {
        // Restart systick...
//        SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
//        SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
        if(!(delay.callback = callback))
            while(delay.ms);
    } else {
        delay.callback = NULL;
        if(callback)
            callback();
    }
}

static bool selectStream (const io_stream_t *stream)
{
    if(!stream)
        stream = serial_stream;

    if(hal.stream.read != stream->read)
        stream->reset_read_buffer();

    memcpy(&hal.stream, stream, sizeof(io_stream_t));

    if(!hal.stream.write_all)
        hal.stream.write_all = hal.stream.write;

    if(!hal.stream.enqueue_realtime_command)
        hal.stream.enqueue_realtime_command = protocol_enqueue_realtime_command;

    if(hal.stream.disable)
        hal.stream.disable(false);

    return stream->type == hal.stream.type;
}

// Enable/disable stepper motors
static void stepperEnable (axes_signals_t enable)
{
    enable.mask ^= settings.steppers.enable_invert.mask;
#if TRINAMIC_ENABLE && TRINAMIC_I2C
    axes_signals_t tmc_enable = trinamic_stepper_enable(enable);
#else
  #ifdef STEPPERS_ENABLE_PORT
    BITBAND_PERI(STEPPERS_ENABLE_PORT->ODR, STEPPERS_ENABLE_PIN) = enable.x;
  #else
    BITBAND_PERI(X_ENABLE_PORT->ODR, X_ENABLE_PIN) = enable.x;
   #ifdef X2_DIRECTION_PIN
    BITBAND_PERI(X2_DIRECTION_PORT->ODR, X2_DIRECTION_PIN) = enable.x;
   #endif
    BITBAND_PERI(Y_ENABLE_PORT->ODR, Y_ENABLE_PIN) = enable.y;
   #ifdef Y2_DIRECTION_PIN
    BITBAND_PERI(Y2_DIRECTION_PORT->ODR, Y2_DIRECTION_PIN) = enable.y;
   #endif
    BITBAND_PERI(Z_ENABLE_PORT->ODR, Z_ENABLE_PIN) = enable.z;
   #ifdef Z2_DIRECTION_PIN
    BITBAND_PERI(Z2_DIRECTION_PORT->ODR, Z2_DIRECTION_PIN) = enable.z;
   #endif
   #ifdef A_ENABLE_PORT
    BITBAND_PERI(A_ENABLE_PORT->ODR, A_ENABLE_PIN) = enable.a;
   #endif
   #ifdef B_ENABLE_PORT
    BITBAND_PERI(B_ENABLE_PORT->ODR, B_ENABLE_PIN) = enable.b;
   #endif
   #ifdef C_ENABLE_PORT
    BITBAND_PERI(C_ENABLE_PORT->ODR, C_ENABLE_PIN) = enable.c;
   #endif
  #endif
#endif
}

// Starts stepper driver ISR timer and forces a stepper driver interrupt callback
static void stepperWakeUp (void)
{
    stepperEnable((axes_signals_t){AXES_BITMASK});

    STEPPER_TIMER->ARR = 5000; // delay to allow drivers time to wake up
    STEPPER_TIMER->EGR = TIM_EGR_UG;
    STEPPER_TIMER->CR1 |= TIM_CR1_CEN;
}

// Disables stepper driver interrupts
static void stepperGoIdle (bool clear_signals)
{
    STEPPER_TIMER->CR1 &= ~TIM_CR1_CEN;
    STEPPER_TIMER->CNT = 0;
}

// Sets up stepper driver interrupt timeout, "Normal" version
static void stepperCyclesPerTick (uint32_t cycles_per_tick)
{
    STEPPER_TIMER->ARR = cycles_per_tick < (1UL << 20) ? cycles_per_tick : 0x000FFFFFUL;
}

// Set stepper pulse output pins
// NOTE: step_outbits are: bit0 -> X, bit1 -> Y, bit2 -> Z...
#ifdef SQUARING_ENABLED

inline static __attribute__((always_inline)) void stepperSetStepOutputs (axes_signals_t step_outbits_1)
{
	axes_signals_t step_outbits_2;
    step_outbits_2.mask = (step_outbits_1.mask & motors_2.mask) ^ settings.steppers.step_invert.mask;

#if STEP_OUTMODE == GPIO_BITBAND
    step_outbits_1.mask = (step_outbits_1.mask & motors_1.mask) ^ settings.steppers.step_invert.mask;

    BITBAND_PERI(X_STEP_PORT->ODR, X_STEP_PIN) = step_outbits_1.x;
    BITBAND_PERI(Y_STEP_PORT->ODR, Y_STEP_PIN) = step_outbits_1.y;
    BITBAND_PERI(Z_STEP_PORT->ODR, Z_STEP_PIN) = step_outbits_1.z;

 #ifdef A_AXIS
    BITBAND_PERI(A_STEP_PORT->ODR, A_STEP_PIN) = step_outbits_1.a;
 #endif
 #ifdef B_AXIS
    BITBAND_PERI(B_STEP_PORT->ODR, B_STEP_PIN) = step_outbits_1.b;
 #endif
 #ifdef C_AXIS
    BITBAND_PERI(C_STEP_PORT->ODR, C_STEP_PIN) = step_outbits_1.c;
 #endif

#elif STEP_OUTMODE == GPIO_MAP
    STEP_PORT->ODR = (STEP_PORT->ODR & ~STEP_MASK) | step_outmap[step_outbits_1.value & motors_1.mask];
#else
    STEP_PORT->ODR = (STEP_PORT->ODR & ~STEP_MASK) | (((step_outbits_1.mask & motors_1.mask) ^ settings.steppers.step_invert.mask) << STEP_OUTMODE);
#endif

#ifdef X2_STEP_PIN
    BITBAND_PERI(X2_STEP_PORT->ODR, X2_STEP_PIN) = step_outbits_2.x;
#endif
#ifdef Y2_STEP_PIN
    BITBAND_PERI(Y2_STEP_PORT->ODR, Y2_STEP_PIN) = step_outbits_2.y;
#endif
#ifdef Z2_STEP_PIN
    BITBAND_PERI(Z2_STEP_PORT->ODR, Z2_STEP_PIN) = step_outbits_2.z;
#endif
}

static axes_signals_t getAutoSquaredAxes (void)
{
    axes_signals_t ganged = {0};

    #if X_AUTO_SQUARE
        ganged.x = On;
    #endif

    #if Y_AUTO_SQUARE
        ganged.y = On;
    #endif

    #if Z_AUTO_SQUARE
        ganged.z = On;
    #endif

    return ganged;
}

// Enable/disable motors for auto squaring of ganged axes
static void StepperDisableMotors (axes_signals_t axes, squaring_mode_t mode)
{
    motors_1.mask = (mode == SquaringMode_A || mode == SquaringMode_Both ? axes.mask : 0) ^ AXES_BITMASK;
    motors_2.mask = (mode == SquaringMode_B || mode == SquaringMode_Both ? axes.mask : 0) ^ AXES_BITMASK;
}

#else // SQUARING DISABLED

inline static __attribute__((always_inline)) void stepperSetStepOutputs (axes_signals_t step_outbits)
{
#if STEP_OUTMODE == GPIO_BITBAND
    step_outbits.mask ^= settings.steppers.step_invert.mask;
    BITBAND_PERI(X_STEP_PORT->ODR, X_STEP_PIN) = step_outbits.x;
  #ifdef X2_STEP_PIN
    BITBAND_PERI(X2_STEP_PORT->ODR, X2_STEP_PIN) = step_outbits.x;
  #endif
    BITBAND_PERI(Y_STEP_PORT->ODR, Y_STEP_PIN) = step_outbits.y;
  #ifdef Y2_STEP_PIN
    BITBAND_PERI(Y2_STEP_PORT->ODR, Y2_STEP_PIN) = step_outbits.y;
  #endif
    BITBAND_PERI(Z_STEP_PORT->ODR, Z_STEP_PIN) = step_outbits.z;
  #ifdef Z2_STEP_PIN
    BITBAND_PERI(Z2_STEP_PORT->ODR, Z2_STEP_PIN) = step_outbits.z;
  #endif
  #ifdef A_AXIS
    BITBAND_PERI(A_STEP_PORT->ODR, A_STEP_PIN) = step_outbits.a;
  #endif
  #ifdef B_AXIS
    BITBAND_PERI(B_STEP_PORT->ODR, B_STEP_PIN) = step_outbits.b;
  #endif
  #ifdef C_AXIS
    BITBAND_PERI(C_STEP_PORT->ODR, C_STEP_PIN) = step_outbits.c;
  #endif
#elif STEP_OUTMODE == GPIO_MAP
    STEP_PORT->ODR = (STEP_PORT->ODR & ~STEP_MASK) | step_outmap[step_outbits.value];
 #if N_GANGED
  #ifdef X2_STEP_PIN
    BITBAND_PERI(X2_STEP_PORT->ODR, X2_STEP_PIN) = step_outbits.x ^ settings.steppers.step_invert.x;
  #endif
  #ifdef Y2_STEP_PIN
    BITBAND_PERI(Y2_STEP_PORT->ODR, Y2_STEP_PIN) = step_outbits.y ^ settings.steppers.step_invert.y;
  #endif
  #ifdef Z2_STEP_PIN
    BITBAND_PERI(Z2_STEP_PORT->ODR, Z2_STEP_PIN) = step_outbits.z ^ settings.steppers.step_invert.z;
  #endif
 #endif
#else
 #if N_GANGED
   step_outbits.mask ^= settings.steppers.step_invert.mask;
   STEP_PORT->ODR = (STEP_PORT->ODR & ~STEP_MASK) | (step_outbits.mask << STEP_OUTMODE);
  #ifdef X2_STEP_PIN
   BITBAND_PERI(X2_STEP_PORT->ODR, X2_STEP_PIN) = step_outbits.x;
  #endif
  #ifdef Y2_STEP_PIN
   BITBAND_PERI(Y2_STEP_PORT->ODR, Y2_STEP_PIN) = step_outbits.y;
  #endif
  #ifdef Z2_STEP_PIN
   BITBAND_PERI(Z2_STEP_PORT->ODR, Z2_STEP_PIN) = step_outbits.z;
  #endif
 #else
   STEP_PORT->ODR = (STEP_PORT->ODR & ~STEP_MASK) | ((step_outbits.value << STEP_OUTMODE) ^ settings.steppers.step_invert.value);
 #endif
#endif
}

#endif

// Set stepper direction output pins
// NOTE: see note for stepperSetStepOutputs()
inline static __attribute__((always_inline)) void stepperSetDirOutputs (axes_signals_t dir_outbits)
{
#if DIRECTION_OUTMODE == GPIO_BITBAND
    dir_outbits.mask ^= settings.steppers.dir_invert.mask;
    BITBAND_PERI(X_DIRECTION_PORT->ODR, X_DIRECTION_PIN) = dir_outbits.x;
    BITBAND_PERI(Y_DIRECTION_PORT->ODR, Y_DIRECTION_PIN) = dir_outbits.y;
    BITBAND_PERI(Z_DIRECTION_PORT->ODR, Z_DIRECTION_PIN) = dir_outbits.z;
#ifdef X2_DIRECTION_PIN
    BITBAND_PERI(X2_DIRECTION_PORT->ODR, X2_DIRECTION_PIN) = dir_outbits.x;
#endif
#ifdef Y2_DIRECTION_PIN
    BITBAND_PERI(Y2_DIRECTION_PORT->ODR, Y2_DIRECTION_PIN) = dir_outbits.y;
#endif
#ifdef Z2_DIRECTION_PIN
    BITBAND_PERI(Z2_DIRECTION_PORT->ODR, Z2_DIRECTION_PIN) = dir_outbits.z;
#endif
#ifdef A_AXIS
    BITBAND_PERI(A_DIRECTION_PORT->ODR, A_DIRECTION_PIN) = dir_outbits.a;
#endif
#ifdef B_AXIS
    BITBAND_PERI(B_DIRECTION_PORT->ODR, B_DIRECTION_PIN) = dir_outbits.b;
#endif
#ifdef C_AXIS
    BITBAND_PERI(C_DIRECTION_PORT->ODR, C_DIRECTION_PIN) = dir_outbits.c;
#endif
#elif DIRECTION_OUTMODE == GPIO_MAP
    DIRECTION_PORT->ODR = (DIRECTION_PORT->ODR & ~DIRECTION_MASK) | dir_outmap[dir_outbits.value];
 #if N_GANGED
  #ifdef X2_DIRECTION_PIN
    BITBAND_PERI(X2_DIRECTION_PORT->ODR, X2_DIRECTION_PIN) = dir_outbits.x ^ settings.steppers.dir_invert.x;
  #endif
  #ifdef Y2_DIRECTION_PIN
    BITBAND_PERI(Y2_DIRECTION_PORT->ODR, Y2_DIRECTION_PIN) = dir_outbits.y ^ settings.steppers.dir_invert.y;
  #endif
  #ifdef Z2_DIRECTION_PIN
    BITBAND_PERI(Z2_DIRECTION_PORT->ODR, Z2_DIRECTION_PIN) = dir_outbits.z ^ settings.steppers.dir_invert.z;
  #endif
 #endif
#else
 #if N_GANGED
    dir_outbits.mask ^= settings.steppers.dir_invert.mask;
    DIRECTION_PORT->ODR = (DIRECTION_PORT->ODR & ~DIRECTION_MASK) | (dir_outbits.mask << DIRECTION_OUTMODE);
  #ifdef X2_DIRECTION_PIN
    BITBAND_PERI(X2_DIRECTION_PORT->ODR, X2_DIRECTION_PIN) = dir_outbits.x;
  #endif
  #ifdef Y2_DIRECTION_PIN
    BITBAND_PERI(Y2_DIRECTION_PORT->ODR, Y2_DIRECTION_PIN) = dir_outbits.y;
  #endif
  #ifdef Z2_DIRECTION_PIN
    BITBAND_PERI(Z2_DIRECTION_PORT->ODR, Z2_DIRECTION_PIN) = dir_outbits.z;
  #endif
 #else
    DIRECTION_PORT->ODR = (DIRECTION_PORT->ODR & ~DIRECTION_MASK) | ((dir_outbits.mask ^ settings.steppers.dir_invert.mask) << DIRECTION_OUTMODE);
 #endif
#endif
}

// Sets stepper direction and pulse pins and starts a step pulse.
static void stepperPulseStart (stepper_t *stepper)
{
#if SPINDLE_SYNC_ENABLE
    if(stepper->new_block && stepper->exec_segment->spindle_sync) {
        spindle_tracker.stepper_pulse_start_normal = hal.stepper.pulse_start;
        hal.stepper.pulse_start = stepperPulseStartSynchronized;
        hal.stepper.pulse_start(stepper);
        return;
    }
#endif

    if(stepper->dir_change)
        stepperSetDirOutputs(stepper->dir_outbits);

    if(stepper->step_outbits.value) {
        stepperSetStepOutputs(stepper->step_outbits);
        PULSE_TIMER->EGR = TIM_EGR_UG;
        PULSE_TIMER->CR1 |= TIM_CR1_CEN;
    }
}

